zhcg/atheros-route/apps/modules_server/stm32_update.c
/******************************************************************************
*
* FILENAME:
*     testcom.c
*
* DESCRIPTION:
*     A utility to read/write serial port
*     Usage: testcom <device> <baud> <databits> <parity> <stopbits> <read_or_write>
*        databits: 5, 6, 7, 8
*        parity: 0(None), 1(Odd), 2(Even)
*        stopbits: 1, 2
*        read_or_write: 0(read), 1(write)
*     Example: testcom /dev/ttyS0 9600 8 0 1 0
*
* REVISION(MM/DD/YYYY):
*     03/12/2008  Shengkui Leng (shengkui.leng@advantech.com.cn)
*     - Initial version
*
******************************************************************************/
#include "common.h"
#include "stm32_update.h"
#include "file.h"
#include "modules_server.h"
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

typedef enum __REQ_RSP_CODE
{
	REQ_RSP_OK = 0X00,
	REQ_RSP_CMD_ERR = 0X01,
	REQ_RSP_XOR_ERR = 0X02,
	REQ_RSP_ADD_ERR = 0X03,
	REQ_RSP_TOTAL_DATA_MORE_ERR = 0X04,
	REQ_RSP_PACKET_INDEX_ERR = 0X10,
	REQ_RSP_DATA_NOT_EQUAL_ERR = 0X11,	
	REQ_RSP_PACKET_DATA_MORE_ERR = 0X12,
	REQ_RSP_WRITE_FLASH_ERR = 0X13,
}REQ_RSP_CODE;


int fsfd;
unsigned int update_bin_file_size;
unsigned char stm_format_sn[12] = {0};
unsigned char stm_format_version[4] = {0x00,0x00,0x00,0x00};
unsigned char bin_format_version[4] = {0x00,0x00,0x00,0x00};
unsigned char stm32_version_des[128] = {0};
unsigned char bin_file_head[8] = {0x41,0x70,0x70,0x42,0x69,0x6E,0x20,0x20};
unsigned char packet_req_head[4] = {0xFE,0xEF,0xA5,0x5A};
unsigned char packet_rsp_head_1[4] = {0xEA,0xFF,0x5A,0xA5};
unsigned char packet_rsp_head_2[4] = {0xFF,0xEA,0x5A,0xA5};

unsigned char update_req_buffer[UPDATE_REQ_BUF_SIZE];
unsigned char update_rsp_buffer[UPDATE_RSP_BUF_SIZE];


int stm32_update(unsigned char* path,int test_flag)
{
    int fd;
    int baud = 115200;
    int len;
    int count;
    int i,ret;
    int databits = 8;
    int stopbits = 1;
    int parity = 0;
    int read_or_write;
	int update;

	if (BinFileHeadCheck(path) == 0){
		update = 0;
		memset(stm_format_version,0,sizeof(stm_format_version));
		if((ret = CmdGetVersion()) != 0){
			update = 1;
			//return -2;
		}
		PRINT("bin_format_version:\n");
		for(i = 0; i < 4; i++)
			PRINT("%x\n ", bin_format_version[i]);

		PRINT("stm_format_version:\n");
		for(i = 0; i < 4; i++)
			PRINT("%x\n ", stm_format_version[i]);
		if(update == 1)
			goto START_UPDATE;
		//比较STM32版本和BIN文件版本
		ret = memcmp((void *)bin_format_version, (void *)stm_format_version, sizeof(bin_format_version)/2);
		if(test_flag == 1)
		{
			ret = 0;
		}
		//PRINT("ret = %d\n",ret);
		if(ret != 0)
		{
			PRINT("MAJOR error!!\n");
			return -1;
		}
		ret = memcmp((void *)bin_format_version, (void *)stm_format_version, sizeof(bin_format_version));
		if(test_flag == 1)
		{
			ret = 1;
		}
		//PRINT("ret = %d\n",ret);
		if(ret <= 0)
		{
			PRINT("STM32 is newest!!\n");
			return -1;
		}
		
		if ((ret > 0) | (update == 1)){
START_UPDATE:
			PRINT("Updata begin !!!\n");
			//if((ret = CmdReBoot()) != 0)
				//return -3;
			CmdReBoot();
			usleep(500 * 1000);
			if((ret = CmdStart()) != 0)
				return -4;
			if((ret = Update(path)) != 0)
				return -5;
			if((ret = CmdEnd()) != 0)
				return -6;
			PRINT("Update success !!!\n");
		}
		

	} else {
		PRINT("BinFileHeadCheck error !!!\n");
		//close(global_uart_fd);
		return -1;
	}

	//close(global_uart_fd);
	usleep(3000 * 1000);
//	}
	return 0;
}


static int baudflag_arr[] = {
    B921600, B460800, B230400, B115200, B57600, B38400,
    B19200,  B9600,   B4800,   B2400,   B1800,  B1200,
    B600,    B300,    B150,    B110,    B75,    B50
};
static int speed_arr[] = {
    921600,  460800,  230400,  115200,  57600,  38400,
    19200,   9600,    4800,    2400,    1800,   1200,
    600,     300,     150,     110,     75,     50
};


/******************************************************************************
* NAME:
*      speed_to_flag
*
* DESCRIPTION:
*      Translate baudrate into flag
*
* PARAMETERS:
*      speed - The baudrate to convert
*
* RETURN:
*      The flag
******************************************************************************/
int speed_to_flag(int speed)
{
    int i;

    for (i = 0;  i < sizeof(speed_arr)/sizeof(int);  i++) {
        if (speed == speed_arr[i]) {
            return baudflag_arr[i];
        }
    }

    fprintf(stderr, "Unsupported baudrate, use 9600 instead!\n");
    return B9600;
}


static struct termio oterm_attr;

/******************************************************************************
* NAME:
*      stup_port
*
* DESCRIPTION:
*      Set serial port (include baudrate, line control)
*
* PARAMETERS:
*      fd       - The fd of serial port to setup
*      baud     - Baudrate: 9600, ...
*      databits - Databits: 5, 6, 7, 8
*      parity   - Parity: 0(None), 1(Odd), 2(Even)
*      stopbits - Stopbits: 1, 2
*
* RETURN:
*      0 for OK; Others for ERROR
******************************************************************************/
int setup_port(int fd, int baud, int databits, int parity, int stopbits)
{
    struct termio term_attr;

    /* Get current setting */
    if (ioctl(fd, TCGETA, &term_attr) < 0) {
        return -1;
    }

    /* Backup old setting */
    memcpy(&oterm_attr, &term_attr, sizeof(struct termio));

    term_attr.c_iflag &= ~(INLCR | IGNCR | ICRNL | ISTRIP);
    term_attr.c_oflag &= ~(OPOST | ONLCR | OCRNL);
    term_attr.c_lflag &= ~(ISIG | ECHO | ICANON | NOFLSH);
    term_attr.c_cflag &= ~CBAUD;
    term_attr.c_cflag |= CREAD | speed_to_flag(baud);

    /* Set databits */
    term_attr.c_cflag &= ~(CSIZE);
    switch (databits) {
        case 5:
            term_attr.c_cflag |= CS5;
            break;

        case 6:
            term_attr.c_cflag |= CS6;
            break;

        case 7:
            term_attr.c_cflag |= CS7;
            break;

        case 8:
        default:
            term_attr.c_cflag |= CS8;
            break;
    }

