zhcg/atheros-route/apps/modules_server/stm32_update.c
    /* Set parity */
    switch (parity) {
        case 1:   /* Odd parity */
            term_attr.c_cflag |= (PARENB | PARODD);
            break;

        case 2:   /* Even parity */
            term_attr.c_cflag |= PARENB;
            term_attr.c_cflag &= ~(PARODD);
            break;

        case 0:   /* None parity */
        default:
            term_attr.c_cflag &= ~(PARENB);
            break;
    }


    /* Set stopbits */
    switch (stopbits) {
        case 2:   /* 2 stopbits */
            term_attr.c_cflag |= CSTOPB;
            break;

        case 1:   /* 1 stopbits */
        default:
            term_attr.c_cflag &= ~CSTOPB;
            break;
    }

    term_attr.c_cc[VMIN] = 1;
    term_attr.c_cc[VTIME] = 0;

    if (ioctl(fd, TCSETAW, &term_attr) < 0) {
        return -1;
    }

    if (ioctl(fd, TCFLSH, 2) < 0) {
        return -1;
    }

    return 0;
}


/******************************************************************************
* NAME:
*      read_data
*
* DESCRIPTION:
*      Read data from serial port
*
*
* PARAMETERS:
*      fd   - The fd of serial port to read
*      buf  - The buffer to keep readed data
*      len  - The max count to read
*
* RETURN:
*      Count of readed data
******************************************************************************/
int read_data(int fd, void *buf, int len)
{
    int count;
    int ret;

    ret = 0;
	count = 0;

    while (len > 0) {

    	ret = read(fd, (char*)(buf + count), len);
    	if (ret < 1) {
			fprintf(stderr, "Read error %s errno = %d\n", strerror(errno), errno);
        	continue;
		}
		
		count += ret;
		len = len - ret;
	}
    return count;
}


/******************************************************************************
* NAME:
*      write_data
*
* DESCRIPTION:
*      Write data to serial port
*
*
* PARAMETERS:
*      fd   - The fd of serial port to write
*      buf  - The buffer to keep data
*      len  - The count of data
*
* RETURN:
*      Count of data wrote
******************************************************************************/
int write_data(int fd, void *buf, int len)
{
    int count;
    int ret;

    ret = 0;
    count = 0;

    while (len > 0) {

        ret = write(fd, (char*)(buf + count), len);
        if (ret < 1) {
            fprintf(stderr, "Write error %s\n", strerror(errno));
            break;
        }

        count += ret;
        len = len - ret;
    }

    return count;
}


/******************************************************************************
* NAME:
*      print_usage
*
* DESCRIPTION:
*      print usage info
*
* PARAMETERS:
*      program_name - The name of the program
*
* RETURN:
*      None
******************************************************************************/
void print_usage(char *program_name)
{
    fprintf(stderr,
            "*************************************\n"
            "  A Simple Serial Port Test Utility\n"
            "*************************************\n\n"
            "Usage:\n  %s <device> <baud> <databits> <parity> <stopbits> <read_or_write>\n"
            "       databits: 5, 6, 7, 8\n"
            "       parity: 0(None), 1(Odd), 2(Even)\n"
            "       stopbits: 1, 2\n"
            "       read_or_write: 0(read), 1(write)\n"
            "Example:\n  %s /dev/ttyS0 9600 8 0 1 0\n\n",
            program_name, program_name
           );
}


/******************************************************************************
* NAME:
*      reset_port
*
* DESCRIPTION:
*      Restore original setting of serial port
*
* PARAMETERS:
*      fd - The fd of the serial port
*
* RETURN:
*      0 for OK; Others for ERROR
******************************************************************************/
int reset_port(int fd)
{
    if (ioctl(fd, TCSETAW, &oterm_attr) < 0) {
        return -1;
    }

    return 0;
}
///////////////////////////////////////////////////////////////////////////////
//获取文件大小
///////////////////////////////////////////////////////////////////////////////

unsigned long get_file_size(const char *path)  
{  
    unsigned long filesize = -1;      
    struct stat statbuff;  
    if(stat(path, &statbuff) < 0){  
        return filesize;  
    }else{  
        filesize = statbuff.st_size;  
    }  
    return filesize;  
}  

///////////////////////////////////////////////////////////////////////////////
//CRC16算法：
///////////////////////////////////////////////////////////////////////////////

/* CRC 高位字节值表 */
static const unsigned char auchCRCHi[] = {
	0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
	0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
	0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
	0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40,
	0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
	0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0, 0x80, 0x41,
	0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
	0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
	0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
	0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40,
	0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
	0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40,
	0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
	0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40,
	0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
	0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40,
	0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
	0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
	0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
	0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
	0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0,
	0x80, 0x41, 0x00, 0xC1, 0x81, 0x40, 0x00, 0xC1, 0x81, 0x40,
	0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0, 0x80, 0x41, 0x00, 0xC1,
	0x81, 0x40, 0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41,
	0x00, 0xC1, 0x81, 0x40, 0x01, 0xC0, 0x80, 0x41, 0x01, 0xC0,
	0x80, 0x41, 0x00, 0xC1, 0x81, 0x40
} ;
/* CRC低位字节值表*/
static const unsigned char auchCRCLo[] = 
{
	0x00, 0xC0, 0xC1, 0x01, 0xC3, 0x03, 0x02, 0xC2, 0xC6, 0x06,
	0x07, 0xC7, 0x05, 0xC5, 0xC4, 0x04, 0xCC, 0x0C, 0x0D, 0xCD,
	0x0F, 0xCF, 0xCE, 0x0E, 0x0A, 0xCA, 0xCB, 0x0B, 0xC9, 0x09,
	0x08, 0xC8, 0xD8, 0x18, 0x19, 0xD9, 0x1B, 0xDB, 0xDA, 0x1A,
	0x1E, 0xDE, 0xDF, 0x1F, 0xDD, 0x1D, 0x1C, 0xDC, 0x14, 0xD4,
	0xD5, 0x15, 0xD7, 0x17, 0x16, 0xD6, 0xD2, 0x12, 0x13, 0xD3,
	0x11, 0xD1, 0xD0, 0x10, 0xF0, 0x30, 0x31, 0xF1, 0x33, 0xF3,
	0xF2, 0x32, 0x36, 0xF6, 0xF7, 0x37, 0xF5, 0x35, 0x34, 0xF4,
	0x3C, 0xFC, 0xFD, 0x3D, 0xFF, 0x3F, 0x3E, 0xFE, 0xFA, 0x3A,
	0x3B, 0xFB, 0x39, 0xF9, 0xF8, 0x38, 0x28, 0xE8, 0xE9, 0x29,
	0xEB, 0x2B, 0x2A, 0xEA, 0xEE, 0x2E, 0x2F, 0xEF, 0x2D, 0xED,
	0xEC, 0x2C, 0xE4, 0x24, 0x25, 0xE5, 0x27, 0xE7, 0xE6, 0x26,
	0x22, 0xE2, 0xE3, 0x23, 0xE1, 0x21, 0x20, 0xE0, 0xA0, 0x60,
	0x61, 0xA1, 0x63, 0xA3, 0xA2, 0x62, 0x66, 0xA6, 0xA7, 0x67,
	0xA5, 0x65, 0x64, 0xA4, 0x6C, 0xAC, 0xAD, 0x6D, 0xAF, 0x6F,
	0x6E, 0xAE, 0xAA, 0x6A, 0x6B, 0xAB, 0x69, 0xA9, 0xA8, 0x68,
	0x78, 0xB8, 0xB9, 0x79, 0xBB, 0x7B, 0x7A, 0xBA, 0xBE, 0x7E,
	0x7F, 0xBF, 0x7D, 0xBD, 0xBC, 0x7C, 0xB4, 0x74, 0x75, 0xB5,
	0x77, 0xB7, 0xB6, 0x76, 0x72, 0xB2, 0xB3, 0x73, 0xB1, 0x71,
	0x70, 0xB0, 0x50, 0x90, 0x91, 0x51, 0x93, 0x53, 0x52, 0x92,
	0x96, 0x56, 0x57, 0x97, 0x55, 0x95, 0x94, 0x54, 0x9C, 0x5C,
	0x5D, 0x9D, 0x5F, 0x9F, 0x9E, 0x5E, 0x5A, 0x9A, 0x9B, 0x5B,
	0x99, 0x59, 0x58, 0x98, 0x88, 0x48, 0x49, 0x89, 0x4B, 0x8B,
	0x8A, 0x4A, 0x4E, 0x8E, 0x8F, 0x4F, 0x8D, 0x4D, 0x4C, 0x8C,
	0x44, 0x84, 0x85, 0x45, 0x87, 0x47, 0x46, 0x86, 0x82, 0x42,
	0x43, 0x83, 0x41, 0x81, 0x80, 0x40
} ;

//unsigned short CRC16(unsigned char *puchMsg, unsigned short usDataLen)
//
//{
	//unsigned char uchCRCHi = 0xFF ; /* 高CRC字节初始化 */
	//unsigned char uchCRCLo = 0xFF ; /* 低CRC 字节初始化 */
	//unsigned uIndex ; 		/* CRC循环中的索引 */
	//while (usDataLen--) 	/* 传输消息缓冲区 */
	//{
		//uIndex = uchCRCHi ^ *(puchMsg++); /* 计算CRC */
		//uchCRCHi = uchCRCLo ^ auchCRCHi[uIndex] ;
		//uchCRCLo = auchCRCLo[uIndex] ;
	//}
	//return (uchCRCHi << 8 | uchCRCLo) ;
//}
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
static unsigned char PacketXorGenerate(const unsigned char *ppatas,int bytes)
{
	unsigned char result = 0;
	int i;
	for(i = 0; i < bytes; i++)
	{
		result ^= ppatas[i];
	}
	return result;
}

///////////////////////////////////////////////////////////////////////////////
static int PacketHeadSearch(unsigned char *pbuf,int offset,int valid_bytes)
{
	int bytes;
	unsigned char *ppcom;
	int i,j;
	ppcom = pbuf;
	bytes = valid_bytes - offset;
	if(bytes < RSP_CMD_MIN_BYTES){
//		PRINT("Error: respond length <　RSP_CMD_MIN_BYTES \n");					
		return -1;
	}
	j = valid_bytes - RSP_CMD_MIN_BYTES;
	for(i = offset;i <= j;i++)
	{		
		if((ppcom[i] == packet_rsp_head_1[0]) && (ppcom[i + 1] == packet_rsp_head_1[1]) && 
			(ppcom[i + 2] == packet_rsp_head_1[2]) && (ppcom[i + 3] == packet_rsp_head_1[3]))
		{
			return i;	
		}
		if((ppcom[i] == packet_rsp_head_2[0]) && (ppcom[i + 1] == packet_rsp_head_2[1]) && 
			(ppcom[i + 2] == packet_rsp_head_2[2]) && (ppcom[i + 3] == packet_rsp_head_2[3])
			&& ((ppcom[i + 6]) != (unsigned char)0x84))
		{
			return i;	
		}
	}
	PRINT("Error: respond packet head not found \n");	
	return -1;
}
///////////////////////////////////////////////////////////////////////////////
int PacketRspGet(unsigned char *pbuf,int offset,int valid_bytes)
{
	unsigned short packet_len;
	unsigned char check_byte;


	packet_len = (pbuf[offset+4] * 256) + pbuf[offset+5];
	packet_len += (4 + 2);
	if(valid_bytes <= packet_len){
		PRINT("Error: respond valid_bytes < packet_len\n");
		return -1;
	}
	check_byte = PacketXorGenerate(pbuf+offset,packet_len);
	if(check_byte == pbuf[packet_len+offset])
	{
		packet_len++;
		return packet_len;
	}
	PRINT("Error: respond xor check error \n");
	return -1;
}

///////////////////////////////////////////////////////////////////////////////
int UpdateRspRcv(unsigned char *prcv_buffer,int buf_size)
{
	int rcv_index;
	int i,j;
	int ret = 0;
	int loops = 0;
	rcv_index = 0;
	do
	{
		loops++;
		if(loops > 20){
			PRINT("Error: get respond timeout \n");
			return -1;
		}
//		PRINT("get respond .... \n");

		usleep(50 * 1000);
//		ret = read_data(global_uart_fd, prcv_buffer, (buf_size - rcv_index));
		ret = read(global_uart_fd, (prcv_buffer + rcv_index), (buf_size - rcv_index));
		//PRINT("ret = %d\n",ret);
//		for(i=0; i<ret; i++)
//			   PRINT("read_data ret = %x \n", prcv_buffer[i]);
		if(ret > 0)
		{
			ComFunPrintfBuffer(prcv_buffer + rcv_index,ret);
			rcv_index += ret;
		}

