zhcg/atheros-route/apps/modules_server/stm32_update.c
		if(rcv_index > 0)
		{
			i = PacketHeadSearch(prcv_buffer,0,rcv_index);
			if(i > -1)
			{
				j = PacketRspGet(prcv_buffer,i,rcv_index);	
				if(j > 1)
				{
					for(ret = 0;ret < j;ret++)
					{
						prcv_buffer[ret] = prcv_buffer[i + ret];
					}
					return j;
				}
				else if(j == -1)
					//return j;
					continue;
			}
		}
	}while(1);
}
/******************************************************************************
* NAME:
*      CmdReBoot
*
* DESCRIPTION:
*      smt32复位进入boot
*
* PARAMETERS:
*      fd - The fd of the serial port
*
* RETURN:
*      0 for OK; Others for ERROR
******************************************************************************/
///////////////////////////////////////////////////////////////////////////////
int OrgReBootPacket(unsigned char *psend_buf)
{
	int index = 0;
	unsigned char check_byte;
//第一级包头
	psend_buf[index++] = 0xEF;
	psend_buf[index++] = 0xFE;
	psend_buf[index++] = 0xA5;
	psend_buf[index++] = 0x5A;
//第一级数据长度，高位在前		
	psend_buf[index++] = 0x00;
	psend_buf[index++] = 0x02;
//数据通道为STM32自身
	psend_buf[index++] = 0x10;
//第二级包头
	//psend_buf[index++] = 0xFE;
	//psend_buf[index++] = 0xEF;
	//psend_buf[index++] = 0xA5;
	//psend_buf[index++] = 0x5A;
//第二级数据长度，高位在前		
	//psend_buf[index++] = 0x00;	
	//psend_buf[index++] = 0x01;	
//第二级命令
	psend_buf[index++] = UPDATE_REBOOT_CMD;
//第二级校验字节	
	//check_byte = PacketXorGenerate((psend_buf+7),(index-7));	
	//psend_buf[index++] = check_byte;
//第一级校验字节
	check_byte = PacketXorGenerate(psend_buf,index);	
	psend_buf[index++] = check_byte;

	return index;	
}

int CmdReBoot(void)
{
	int ret;
	int packet_bytes;
	int i;
	PRINT("Enter %s ......\n", __FUNCTION__);
	packet_bytes = OrgReBootPacket(update_req_buffer);
//	PRINT("update_req_buffer:  \n");
//	for(i = 0; i < packet_bytes; i++)
//		PRINT("%x ", update_req_buffer[i]);
//	PRINT("\n");
	//发送命令请求
	ret = write_data(global_uart_fd, update_req_buffer, packet_bytes);
	if (ret != packet_bytes){
		fprintf(stderr, "%s request error %s\n", __FUNCTION__, strerror(errno));
	}
	//获取STM32的响应
	ret = UpdateRspRcv(update_rsp_buffer,sizeof(update_rsp_buffer));
//	ret = UpdateRspRcv(update_rsp_buffer,8);
//	PRINT("update_rsp_buffer:  \n");
//	for(i = 0; i < ret; i++)
//		PRINT("%x ", update_rsp_buffer[i]);
//	PRINT("\n");

	//解析响应
	if(ret >= RSP_CMD_MIN_BYTES)
	{
		//判断响应
		if((update_rsp_buffer[6] != (char)0X10) || (update_rsp_buffer[7] != UPDATE_REBOOT_CMD))
		{
			PRINT("%s command respond error \n", __FUNCTION__);
			return -1;				
		}	
		{
			switch(update_rsp_buffer[8])
			{
				case REQ_RSP_OK:
					PRINT("%s command execute OK! \n", __FUNCTION__);
					PRINT("jump to boot mode ...... \n");
					break;	
				default:
					PRINT("%s command execute error! \n", __FUNCTION__);
					return -1;
			}
			return 0;
		}		
	}
	return -1;	
}

int OrgGetSnPacket(unsigned char *psend_buf)
{
	int index = 0;
	unsigned char check_byte;

//第一级包头
	psend_buf[index++] = 0xEF;
	psend_buf[index++] = 0xFE;
	psend_buf[index++] = 0xA5;
	psend_buf[index++] = 0x5A;
//第一级数据长度，高位在前		
	psend_buf[index++] = 0x00;
	psend_buf[index++] = 0x02;
//数据通道为STM32自身
	psend_buf[index++] = 0x10;

	psend_buf[index++] = UPDATE_GETSN_CMD;

//第一级校验字节
	check_byte = PacketXorGenerate(psend_buf,index);	
	psend_buf[index++] = check_byte;
	return index;	
}

int CmdGetSn(void)
{
	int ret;
	int packet_bytes;
	int i;
	PRINT("Enter %s ......\n", __FUNCTION__);
	packet_bytes = OrgGetSnPacket(update_req_buffer);
//	PRINT("update_req_buffer:  \n");
//	for(i = 0; i < packet_bytes; i++)
//		PRINT("%x ", update_req_buffer[i]);
//	PRINT("\n");
	//发送命令请求
	ret = write_data(global_uart_fd, update_req_buffer, packet_bytes);
	if (ret != packet_bytes){
		fprintf(stderr, "%s request error %s\n", __FUNCTION__, strerror(errno));
	}
	//获取STM32的响应
	ret = UpdateRspRcv(update_rsp_buffer,sizeof(update_rsp_buffer));
//	PRINT("update_rsp_buffer:  \n");
//	for(i = 0; i < ret; i++)
//		PRINT("%x ", update_rsp_buffer[i]);
//	PRINT("\n");

	//解析响应
	if(ret >= RSP_CMD_MIN_BYTES)
	{
		//判断响应
		if((update_rsp_buffer[6] != (char)0X10) || (update_rsp_buffer[7] != UPDATE_GETSN_CMD))
		{
			PRINT("%s command respond error \n", __FUNCTION__);
			return -1;				
		}	
		{
			switch(update_rsp_buffer[8])
			{
				case REQ_RSP_OK:
					PRINT("%s command execute OK! \n", __FUNCTION__);					
					memcpy((void *)(stm_format_sn),(void *)(update_rsp_buffer + 9),sizeof(stm_format_sn));
					ComFunPrintfBuffer(stm_format_sn,sizeof(stm_format_sn));
					break;	
				default:
					PRINT("%s command execute error! \n", __FUNCTION__);
					return -1;
			}
			return 0;
		}		
	}
	return -1;	
}

int OrgGetVerDesPacket(unsigned char *psend_buf)
{
	int index = 0;
	unsigned char check_byte;

//第一级包头
	psend_buf[index++] = 0xEF;
	psend_buf[index++] = 0xFE;
	psend_buf[index++] = 0xA5;
	psend_buf[index++] = 0x5A;
//第一级数据长度，高位在前		
	psend_buf[index++] = 0x00;
	psend_buf[index++] = 0x02;
//数据通道为STM32自身
	psend_buf[index++] = 0x10;

	psend_buf[index++] = 0x81;

//第一级校验字节
	check_byte = PacketXorGenerate(psend_buf,index);	
	psend_buf[index++] = check_byte;
	return index;	
}

int CmdGetVersionDes(void)
{
	int ret;
	int packet_bytes;
	int i;
	PRINT("Enter %s ......\n", __FUNCTION__);
	packet_bytes = OrgGetVerDesPacket(update_req_buffer);
//	PRINT("update_req_buffer:  \n");
//	for(i = 0; i < packet_bytes; i++)
//		PRINT("%x ", update_req_buffer[i]);
//	PRINT("\n");
	//发送命令请求
	ret = write_data(global_uart_fd, update_req_buffer, packet_bytes);
	if (ret != packet_bytes){
		fprintf(stderr, "%s request error %s\n", __FUNCTION__, strerror(errno));
	}
	//获取STM32的响应
	ret = UpdateRspRcv(update_rsp_buffer,sizeof(update_rsp_buffer));
//	PRINT("update_rsp_buffer:  \n");
//	for(i = 0; i < ret; i++)
//		PRINT("%x ", update_rsp_buffer[i]);
//	PRINT("\n");

	//解析响应
	if(ret >= RSP_CMD_MIN_BYTES)
	{
		//判断响应
		if((update_rsp_buffer[6] != (char)0X10) || (update_rsp_buffer[7] != UPDATE_GETVERDES_CMD))
		{
			PRINT("%s command respond error \n", __FUNCTION__);
			return -1;				
		}	
		{
			switch(update_rsp_buffer[8])
			{
				case REQ_RSP_OK:
					PRINT("%s command execute OK! \n", __FUNCTION__);					
					memset(stm32_version_des,0,sizeof(stm32_version_des));
					memcpy((void *)(stm32_version_des),(void *)(update_rsp_buffer + 9),((update_rsp_buffer[4]<<8)+update_rsp_buffer[5]-3));
					PRINT("%s\n",stm32_version_des);
					break;	
				default:
					PRINT("%s command execute error! \n", __FUNCTION__);
					return -1;
			}
			return 0;
		}		
	}
	return -1;	
}


