zhcg/atheros-route/apps/modules_server/stm32_update.c
/******************************************************************************
* NAME:
*      CmdGetVersion
*
* DESCRIPTION:
*      获得smt32应用的版本号
*
* PARAMETERS:
*      fd - The fd of the serial port
*
* RETURN:
*      0 for OK; Others for ERROR
******************************************************************************/
///////////////////////////////////////////////////////////////////////////////
int OrgGetVerPacket(unsigned char *psend_buf)
{
	int index = 0;
	unsigned char check_byte;

//第一级包头
	psend_buf[index++] = 0xEF;
	psend_buf[index++] = 0xFE;
	psend_buf[index++] = 0xA5;
	psend_buf[index++] = 0x5A;
//第一级数据长度，高位在前		
	psend_buf[index++] = 0x00;
	psend_buf[index++] = 0x02;
//数据通道为STM32自身
	psend_buf[index++] = 0x10;

	psend_buf[index++] = 0x80;

//第一级校验字节
	check_byte = PacketXorGenerate(psend_buf,index);	
	psend_buf[index++] = check_byte;
	return index;	
}

int CmdGetVersion(void)
{
	int ret;
	int packet_bytes;
	int i;
	PRINT("Enter %s ......\n", __FUNCTION__);
	packet_bytes = OrgGetVerPacket(update_req_buffer);
//	PRINT("update_req_buffer:  \n");
//	for(i = 0; i < packet_bytes; i++)
//		PRINT("%x ", update_req_buffer[i]);
//	PRINT("\n");
	//发送命令请求
	ret = write_data(global_uart_fd, update_req_buffer, packet_bytes);
	if (ret != packet_bytes){
		fprintf(stderr, "%s request error %s\n", __FUNCTION__, strerror(errno));
	}
	//获取STM32的响应
	ret = UpdateRspRcv(update_rsp_buffer,sizeof(update_rsp_buffer));
//	PRINT("update_rsp_buffer:  \n");
//	for(i = 0; i < ret; i++)
//		PRINT("%x ", update_rsp_buffer[i]);
//	PRINT("\n");

	//解析响应
	if(ret >= RSP_CMD_MIN_BYTES)
	{
		//判断响应
		if((update_rsp_buffer[6] != (char)0X10) || (update_rsp_buffer[7] != UPDATE_GETVER_CMD))
		{
			PRINT("%s command respond error \n", __FUNCTION__);
			return -1;				
		}	
		{
			switch(update_rsp_buffer[8])
			{
				case REQ_RSP_OK:
					PRINT("%s command execute OK! \n", __FUNCTION__);					
					memcpy((void *)(stm_format_version),(void *)(update_rsp_buffer + 9),sizeof(stm_format_version));
					PRINT("major version: %d\n", stm_format_version[0]);
					PRINT("minor version: %d\n", stm_format_version[1]);
					PRINT("sub version: %d\n", (stm_format_version[2] << 8) + stm_format_version[3]);					
					break;	
				default:
					PRINT("%s command execute error! \n", __FUNCTION__);
					return -1;
			}
			return 0;
		}		
	}
	return -1;	
}
/******************************************************************************
* NAME:
*      CmdStart
*
* DESCRIPTION:
*      升级开始命令
*
* PARAMETERS:
*      fd - The fd of the serial port
*
* RETURN:
*      0 for OK; Others for ERROR
******************************************************************************/
///////////////////////////////////////////////////////////////////////////////
int OrgStartPacket(unsigned char *psend_buf,unsigned int app_start_add,unsigned int app_file_size)
{
	int index = 4;
	unsigned char check_byte;

	memcpy((void *)(psend_buf),(void *)(packet_req_head),sizeof(packet_req_head));
	psend_buf[index++] = 0;
	psend_buf[index++] = 9;

	psend_buf[index++] = UPDATE_START_CMD;

	psend_buf[index++] = (app_start_add >> 24)& 0xff;
	psend_buf[index++] = (app_start_add >> 16)& 0xff;
	psend_buf[index++] = (app_start_add >> 8)& 0xff;
	psend_buf[index++] = app_start_add & 0xff;

	psend_buf[index++] = (app_file_size >> 24)& 0xff;
	psend_buf[index++] = (app_file_size >> 16)& 0xff;
	psend_buf[index++] = (app_file_size >> 8)& 0xff;
	psend_buf[index++] = app_file_size & 0xff;
	check_byte = PacketXorGenerate(psend_buf,index);
	psend_buf[index++] = check_byte;
	return index;
}

int CmdStart(void)
{
	int ret;
	int packet_bytes;
	int i;
	int msg_head_type = 0;
	PRINT("Enter %s ......\n", __FUNCTION__);
	packet_bytes = OrgStartPacket(update_req_buffer, UPDATE_APP_START_ADD, update_bin_file_size);
//	PRINT("update_req_buffer:  \n");
//	for(i = 0; i < packet_bytes; i++)
//		PRINT("%x ", update_req_buffer[i]);
//	PRINT("\n");
	//发送命令请求
	ret = write_data(global_uart_fd, update_req_buffer, packet_bytes);
	//ComFunPrintfBuffer(update_req_buffer,packet_bytes);
	if (ret != packet_bytes){
		fprintf(stderr, "%s request error %s\n", __FUNCTION__, strerror(errno));
	}
	//获取STM32的响应
	ret = UpdateRspRcv(update_rsp_buffer,sizeof(update_rsp_buffer));
//	PRINT("update_rsp_buffer:  \n");
//	for(i = 0; i < ret; i++)
//		PRINT("%x ", update_rsp_buffer[i]);
//	PRINT("\n");

	//解析响应
	if(ret >= RSP_CMD_MIN_BYTES)
	{
		//判断响应
		if((update_rsp_buffer[6] != UPDATE_START_CMD))
		{
			PRINT("%s command respond error \n", __FUNCTION__);
			return -1;				
		}	
		{
			switch(update_rsp_buffer[7])
			{
				case REQ_RSP_OK:
					PRINT("%s command execute OK! \n", __FUNCTION__);					
					break;	
				default:
					PRINT("%s command execute error! \n", __FUNCTION__);
					return -1;
			}
			return 0;
		}		
	}
	return -1;	
}
/******************************************************************************
* NAME:
*      CmdDataTrans
*
* DESCRIPTION:
*      传输设计数据
*
* PARAMETERS:
*      fd - The fd of the serial port
*
* RETURN:
*      0 for OK; Others for ERROR
******************************************************************************/
///////////////////////////////////////////////////////////////////////////////
int OrgDataTransPacket(unsigned char *psend_buf,unsigned char *pfile_buf,
					   unsigned short packet_index,unsigned int packet_data_size)
{
	int index = 4;
//	unsigned int packet_data_size;
	unsigned short packet_len;
	unsigned char check_byte;

//	packet_data_size = file_size - *file_send_size;
//	if(packet_data_size > UPDATE_DATA_MAX_BYTES)
//		packet_data_size = UPDATE_DATA_MAX_BYTES;
	
	memcpy((void *)(psend_buf),(void *)(packet_req_head),sizeof(packet_req_head));
	packet_len = packet_data_size + 5; 
	psend_buf[index++] = (packet_len >> 8) & 0xff;
	psend_buf[index++] = packet_len & 0xff;

	psend_buf[index++] = UPDATE_DATA_CMD;

