zhcg/atheros-route/apps/modules_server/stm32_update.c
//	packet_index++;
	psend_buf[index++] = (packet_index >> 8) & 0xff;
	psend_buf[index++] = packet_index & 0xff;

	psend_buf[index++] = (packet_data_size >> 8) & 0xff;
	psend_buf[index++] = packet_data_size & 0xff;

	memcpy((void *)(psend_buf + index),(void *)pfile_buf,packet_data_size);

	index += packet_data_size;
//	*file_send_size += packet_data_size;
	check_byte = PacketXorGenerate(psend_buf,index);
	psend_buf[index++] = check_byte;
	return index;
}

int CmdDataTrans(unsigned char *pfile_buf, unsigned short packet_index,unsigned int packet_data_size)
{
	int ret;
	int packet_bytes;
	int i;
	PRINT("Enter %s ......\n", __FUNCTION__);
	packet_bytes = OrgDataTransPacket(update_req_buffer, pfile_buf, packet_index, packet_data_size);
//	PRINT("update_req_buffer: %d \n", packet_bytes);
//	for(i = 0; i < packet_bytes; i++)
//		PRINT("%x ", update_req_buffer[i]);
//	PRINT("\n");
	//发送命令请求
	ret = write_data(global_uart_fd, update_req_buffer, packet_bytes);
	if (ret != packet_bytes){
		fprintf(stderr, "%s request error %s\n", __FUNCTION__, strerror(errno));
	}
	//获取STM32的响应
	ret = UpdateRspRcv(update_rsp_buffer,sizeof(update_rsp_buffer));
//	PRINT("update_rsp_buffer:  \n");
//	for(i = 0; i < ret; i++)
//		PRINT("%x ", update_rsp_buffer[i]);
//	PRINT("\n");

	//解析响应
	if(ret >= RSP_CMD_MIN_BYTES)
	{
		//判断响应
		if((update_rsp_buffer[6] != UPDATE_DATA_CMD))
		{
			PRINT("%s command respond error \n", __FUNCTION__);
			return -1;				
		}	
		{
			switch(update_rsp_buffer[7])
			{
				case REQ_RSP_OK:
					PRINT("%s command execute OK! \n", __FUNCTION__);					
					break;	
				default:
					PRINT("%s command execute error! \n", __FUNCTION__);
					return -1;
			}
			return 0;
		}		
	}
	return -1;	
}
///////////////////////////////////////////////////////////////////////////////////////
int Update(const char *path)
{
	int i,ret,fd;
	int timeout = 0;
	unsigned int update_packet_num,last_packet_len;
	unsigned char bin_file_buffer[UPDATE_DATA_MAX_BYTES];
	fd = open(path, O_RDONLY, 0);
//	PRINT("fsfd = %d \n", fd);
	if (fd < 0) {
		fprintf(stderr, "open <%s> error %s\n", path, strerror(errno));
		return -1;
	}
	update_packet_num = (update_bin_file_size / UPDATE_DATA_MAX_BYTES);
	last_packet_len = (update_bin_file_size % UPDATE_DATA_MAX_BYTES);
	lseek(fd, BIN_FILE_HEAD_BYTES, SEEK_SET);
	//PRINT("update_packet_num::: %d\n",update_packet_num);
	for(i = 1; i <= update_packet_num; i++){
		timeout = 0;
		ret = read_data(fd, bin_file_buffer, UPDATE_DATA_MAX_BYTES);
		do{
			timeout++;
			if(timeout >= 3){
				close(fd);
				return -1;
			}
			ret = CmdDataTrans(bin_file_buffer, i, UPDATE_DATA_MAX_BYTES);
		}while(ret != 0);

	}
	timeout = 0;
	ret = read_data(fd, bin_file_buffer, last_packet_len);
	do{
		timeout++;
		if(timeout >= 3){
			close(fd);
			return -1;
		}
		ret = CmdDataTrans(bin_file_buffer, i, last_packet_len);
	}while(ret != 0);

	close(fd);

	return 0;
}
/******************************************************************************
* NAME:
*      CmdEnd
*
* DESCRIPTION:
*      升级结束
*
* PARAMETERS:
*      fd - The fd of the serial port
*
* RETURN:
*      0 for OK; Others for ERROR
******************************************************************************/
///////////////////////////////////////////////////////////////////////////////
int OrgEndPacket(unsigned char *psend_buf)
{
	int index = 4;
	unsigned char check_byte;

	memcpy((void *)(psend_buf),(void *)(packet_req_head),sizeof(packet_req_head));
	psend_buf[index++] = 0;
	psend_buf[index++] = 1;
	psend_buf[index++] = UPDATE_END_CMD;
	check_byte = PacketXorGenerate(psend_buf,index);
	psend_buf[index++] = check_byte;
	return index;	
}

int CmdEnd(void)
{
	int ret;
	int packet_bytes;
	int i;
	PRINT("Enter %s ......\n", __FUNCTION__);
	packet_bytes = OrgEndPacket(update_req_buffer);
//	PRINT("update_req_buffer:  \n");
//	for(i = 0; i < packet_bytes; i++)
//		PRINT("%x ", update_req_buffer[i]);
//	PRINT("\n");
	//发送命令请求
	ret = write_data(global_uart_fd, update_req_buffer, packet_bytes);
	if (ret != packet_bytes){
		fprintf(stderr, "%s request error %s\n", __FUNCTION__, strerror(errno));
	}
	//获取STM32的响应
	ret = UpdateRspRcv(update_rsp_buffer,sizeof(update_rsp_buffer));
//	PRINT("update_rsp_buffer:  \n");
//	for(i = 0; i < ret; i++)
//		PRINT("%x ", update_rsp_buffer[i]);
//	PRINT("\n");

	//解析响应
	if(ret >= RSP_CMD_MIN_BYTES)
	{
		//判断响应
		if((update_rsp_buffer[6] != UPDATE_END_CMD))
		{
			PRINT("%s command respond error \n", __FUNCTION__);
			return -1;				
		}	
		{
			switch(update_rsp_buffer[7])
			{
				case REQ_RSP_OK:
					PRINT("%s command execute OK! \n", __FUNCTION__);					
					break;	
				default:
					PRINT("%s command execute error! \n", __FUNCTION__);
					return -1;
			}
			return 0;
		}		
	}
	return -1;	
}



int BinFileHeadCheck(const char *path)
{
	int i,ret,fd;
	unsigned short crc_check,crc_ret;
	unsigned char bin_file_buffer[BIN_FILE_HEAD_BYTES];
	fd = open(path, O_RDONLY, 0);
	//PRINT("fsfd = %d \n", fd);
	if (fd < 0) {
		fprintf(stderr, "open <%s> error %s\n", path, strerror(errno));
		return -1;
	}
	ret = read_data(fd, bin_file_buffer, BIN_FILE_HEAD_BYTES);
//	PRINT("read_data = %d \n", ret);
//	for(i = 0; i < ret; i++)
//		PRINT("%x ", bin_file_buffer[i]);
//	PRINT("\n");
	//比较文件头
	if(memcmp((void *)bin_file_buffer, (void *)bin_file_head, sizeof(bin_file_head))){
		PRINT("Update bin file head error!!!\n");
		return -1;
	} else {
		//获得版本号
		memcpy((void *)bin_format_version, (void *)(bin_file_buffer + 8),
					sizeof(bin_format_version));
		//获得CRC校验结果
		crc_check = (bin_file_buffer[12] << 8) + bin_file_buffer[13];
		//获得bin文件长度
		update_bin_file_size = (bin_file_buffer[14] << 24) + 
							   (bin_file_buffer[15] << 16) +
							   (bin_file_buffer[16] << 8) +
							   (bin_file_buffer[17]);
	}

	//读取bin文件
	unsigned char *bin_file = malloc(update_bin_file_size + 4);
//	unsigned char bin_file[20 * 1024];
	lseek(fd, (BIN_FILE_HEAD_BYTES - 4), SEEK_SET);
	ret = read_data(fd, bin_file, (update_bin_file_size + 4));
//	PRINT("read_data = %d \n", ret);
	crc_ret = CRC16(bin_file, (update_bin_file_size + 4));
//	PRINT("read_data = %x \n", crc_ret);
	free(bin_file);
	close(fd);
	//比较CRC校验值
	if(crc_ret == crc_check){
		return 0;
	} else {
		PRINT("Update bin file CRC error!!!\n");
		return -1;
	}
	
}
